#+TITLE: Laravel e Heroku
#+SUBTITLE: Compreendendo nosso projeto
#+DESCRIPTION:
#+KEYWORDS:
#+EXPORT_FILE_NAME:
#+LANGUAGE: pt-BR
#+EXCLUDE_TAGS: noexport
#+EXPORT_EXCLUDE_TAGS: noexport
#+AUTHOR:    wagner
#+EMAIL:     wagner.marques3@etec.sp.gov.br
#+DATE:


#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export

#+LINK_UP:
#+LINK_HOME:

#+OPTIONS: H:2 toc:t

#+LaTeX_CLASS_OPTIONS: [bigger]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}

* Apresentando a estrutura do nosso projeto
  
#+NAME: tree proj
#+BEGIN_SRC shell :session s1 :results output :exports both
  pwd
#+END_SRC

#+RESULTS: tree proj
: /home/wagner/envs/env-dev/sources/somewritings/planosdeaulas/BD3


eu to usando comandos pra mostrar os arquivos e pastas, as vc pode
visualizar pelas pastas do windows normalmente...

#+NAME:cd /home/wagner/envs/env-dev
#+BEGIN_SRC shell :session s1 :results output :exports both
  cd /home/wagner/envs/env-dev/sources/backupsys
  ls -l
#+END_SRC

#+RESULTS: cd /home/wagner/envs/env-dev
#+begin_example

total 276
drwxrwxr-x.  6 wagner wagner   4096 abr 15 07:46 app
-rwxr-xr-x.  1 wagner wagner   1686 abr 15 07:46 artisan
drwxrwxr-x.  3 wagner wagner   4096 abr 15 07:46 bootstrap
-rw-rw-r--.  1 wagner wagner   1586 abr 15 07:46 composer.json
-rw-rw-r--.  1 wagner wagner 208590 mai 18 07:10 composer.lock
drwxrwxr-x.  2 wagner wagner   4096 abr 15 07:46 config
drwxrwxr-x.  5 wagner wagner   4096 abr 15 07:46 database
-rw-rw-r--.  1 wagner wagner   1013 abr 15 07:46 package.json
-rw-rw-r--.  1 wagner wagner   1197 abr 15 07:46 phpunit.xml
drwxrwxr-x.  2 wagner wagner   4096 abr 15 07:46 public
-rw-rw-r--.  1 wagner wagner   4497 abr 15 07:46 README.md
drwxrwxr-x.  6 wagner wagner   4096 abr 15 07:46 resources
drwxrwxr-x.  2 wagner wagner   4096 abr 15 07:46 routes
-rw-rw-r--.  1 wagner wagner    563 abr 15 07:46 server.php
drwxrwxr-x.  5 wagner wagner   4096 abr 15 07:46 storage
drwxrwxr-x.  4 wagner wagner   4096 abr 15 07:46 tests
drwxrwxr-x. 44 wagner wagner   4096 mai 18 07:10 vendor
-rw-rw-r--.  1 wagner wagner    538 abr 15 07:46 webpack.mix.js
#+end_example

Nosso projeto tem muitos diretorios e arquivos...

Vamos conversar um pouco sobre eles 


** Midleware
   Vc pode definir um middleware e dizer pro laravel fazer com que
   cada request passe por ele antes de tudo... ou passe por ele depois
   de todos os processamentos...

   O comando abaixo e a maneir aque vc tem pra criar um middleware
   
   php artisan make:middleware <middleware-name>

   Vou criar um middleare que verifica se o usuario que ta fazendo o
   request e admin e ser... a ideia e que a gente pode fazer essa
   verificacao pras areas do site que so o admin pode acessar...
   
#+NAME:php artisan make:middleware isAdminMiddleware
#+BEGIN_SRC shell :session s1 :results output :exports both
  [wagner@compras6 backupsys] $ php artisan make:middleware isAdminMiddleware
  Middleware created successfully.
#+END_SRC

Pra ver o nosso middleware e tambe outros que ja foram criados
durentae a criacao do nosso projeto vce pode acessar a pasta
seuprojeto/app/Http/Middleware


#+NAME: ls -l app/Http/Middleware
#+BEGIN_SRC shell :session s1 :results output :exports both
   cd /home/wagner/envs/env-dev/sources/backupsys
   ls -l app/Http/Middleware
#+END_SRC

#+RESULTS: ls -l app/Http/Middleware
#+begin_example

total 32
-rw-rw-r--. 1 wagner wagner 469 abr 15 07:46 Authenticate.php
-rw-rw-r--. 1 wagner wagner 335 abr 15 07:46 CheckForMaintenanceMode.php
-rw-rw-r--. 1 wagner wagner 294 abr 15 07:46 EncryptCookies.php
-rw-rw-r--. 1 wagner wagner 337 mai 18 15:30 isAdminMiddleware.php
-rw-rw-r--. 1 wagner wagner 582 abr 15 07:46 RedirectIfAuthenticated.php
-rw-rw-r--. 1 wagner wagner 340 abr 15 07:46 TrimStrings.php
-rw-rw-r--. 1 wagner wagner 436 abr 15 07:46 TrustProxies.php
-rw-rw-r--. 1 wagner wagner 307 abr 15 07:46 VerifyCsrfToken.php
#+end_example

#+INCLUDE: /home/wagner/envs/env-dev/sources/backupsys/app/Http/Middleware/isAdminMiddleware.php :src php :lines "1-"



